{
  "title": "Brain Evolution, Continual Learning, Website UI, Memory Reconstruction",
  "thoughts": [
    {
      "id": 1,
      "content": "Watched this talk [\"Genes, Cognition, and Human Brain Evolution\"](https://www.youtube.com/watch?v=tN1Bc-WT0oQ) from Dr. Christopher Walsh. I learned about how the human brain evolved in size and what happened in genetic space. It's quite interesting that the brain size is going through an exponential when seen in millions of year scale and yet everything we consider \"highly intelligent\" from agriculture, writing, computers etc is really just a dot on the exponential. So we are in that exponential, trying to create an exponentially improving AI even within that dot! I have also learned about Human Accelerated Regions which seems to be regions in the non-coding part of the genome which are significantly different only in humans compared to other mammals. Given the speed of how slow evolving new genes are, it is really plausible that HARs modifying the expression pattern and neuronal development pattern made all the difference! This sounds really fascinating, but is there any way to reproduce such a phenomena in silico? It must probably start pretty \"forced to happen\" but it would still be cool to find the right analogies in the computational space.",
      "time": "00:01",
      "tags": []
    },
    {
      "id": 2,
      "content": "Launched multiple deep research to see if people have tried to solve continual learning with evolutionary/genetic algorithms",
      "time": "00:05",
      "tags": []
    },
    {
      "id": 3,
      "content": "I long wanted to find the best way to track all my research ideas and thinking process. But maybe its just time to stop finding the right tool or designing the right tool. I should just track it in a very raw form in json. Later, we can get a better system.",
      "time": "00:10",
      "tags": []
    },
    {
      "id": 4,
      "content": "Enhanced thought tracking visual aspect on my website. I also made a password system since it feels weird to reveal literally all thoughts to everyone on the web. But okay, nothing too private will go here, so superficial block seems fine... If they are a dev, sure, steal my thoughts.",
      "time": "00:40",
      "tags": []
    },
    {
      "id": 5,
      "content": "Removed all tags from thoughts. These tags will be generated by AI later anyways and I should make a system which generates adequate tags.",
      "time": "00:50",
      "tags": []
    },
    {
      "id": 6,
      "content": "Okay, let me try to reconstruct Aug 25,26 from episodic memory....",
      "time": "01:00",
      "tags": []
    }
  ]
}